/* 
  Localizable.strings
  Tenorshare4DDiG

  Created by Tenorshare on 2022/7/27.
  
*/

"language" = "en";
"languageGA" = "en";

/*******NSMenu title*****/
"About %@" = "About %@";
"Buy Now" = "Buy Now";
"BUY NOW_s" = "BUY NOW";
"Register" = "Register";
"Check for updates" = "Check for Updates";
"Service" = "Service";
"Hide %@" = "Hide %@";
"Quit %@" = "Quit %@";
"Hide Others" = "Hide Other";
"Show All" = "Show All";

"Edit" = "Edit";
"Undo" = "Undo";
"Redo" = "Redo";
"Cut" = "Cut";
"Copy" = "Copy";
"Paste" = "Paste";
//"Clear" = "Clear";
"Clear" = "Delete";
"Select All" = "Select All";

"Window" = "Window";
"Minimize" = "Minimize";
"Zoom" = "Zoom";
"Enter Full Screen" = "Enter Full Screen";
"Bring All to Front" = "Bring All to Front";

"Help" = "Help";
"Guide" = "Guide";
"Feedback" = "Feedback";
"Support" = "Support";

"Open Log" = "Open Log";

//通用按钮title
"OK" = "OK";
"Contact us" = "Contact us";
"Save" = "Yes";
"Cancel" = "No";
"Open" = "Open";
"Refresh" = "Refresh";

// about window
"Tenorshare %@ %@ Build Date %@" = "Tenorshare %@ %@ Build Date %@";
"%@ %@ Build Date %@" = "%@ %@ Build Date %@";
"All Rights Reserved." = "All Rights Reserved.";

"Tree View" = "Tree View";
"File View" = "File View";

//ScanView+Recovery
"Please select the file you want to recover." =
"Please select the file you want to recover.";

"Saving files to the partition where you lost them will reduce the chances of a successful recovery. It's recommended to recover the files to a removable disk." =
"Saving files to the partition where you lost them will reduce the chances of a successful recovery. It's recommended to recover the files to a removable disk.";

"Saving files to the partition where you lost them will reduce the chances of a successful recovery. Are you sure you want to continue?" =
"Saving files to the partition where you lost them will reduce the chances of a successful recovery. Are you sure you want to continue?";

"Not enough space available on the disk. Additional %@ space is needed to recover these files." =
"Not enough space available on the disk. Additional %@ space is needed to recover these files.";

"Recovering: %@" =
"Recovering: %@";
"Please wait..." =
"Please wait...";

"Recovery completed!" =
"Recovery completed!";
"Click Open button to check the recovered files." =
"Click Open button to check the recovered files.";

"Are you sure you want to stop recovery?" =
"Are you sure you want to stop recovery?";

"Failed to save data to the target disk. Please choose another disk and try again." =
"Failed to save data to the target disk. Please choose another disk and try again.";

"Your disk is disconnected. Please reinsert and try again." =
"Your disk is disconnected. Please reinsert and try again.";

"Save failed due to disconnection of the target disk. Please reinsert and try again." =
"Save failed due to disconnection of the target disk. Please reinsert and try again.";

"Note:" = "Note:";
"Please do not save the recovered files to the partition where you lost them. This may cause permanent data loss." =
"Please do not save the recovered files to the partition where you lost them. This may cause permanent data loss.";


/*******扫描模块*****/
"All Files" = "All Files";
"Photo" = "Photo";
"Audio" = "Audio";
"Video" = "Video";
"Document" = "Document";
"Email" = "Email";
"Webfile" = "Webfile";
"Archive" = "Archive";
"No Extension" = "No Extension";
"Others" = "Others";
/*"Desktop" = "Desktop";
"Documents" = "Documents";
"Downloads" = "Downloads";*/
"Trash" = "Trash";
"Lost location" = "Lost Location";
"More" = "More";
"The scan result will not be saved if you close the program now. Are you sure you want to close?" =
"The scan result will not be saved if you close the program now. Are you sure you want to close?";
"YES" = "YES";
"No" = "No";
"Are you sure you want to stop scanning?" = "Are you sure you want to stop scanning?";
"The scan result will not be saved now. Are you sure you want to return Home?" =
"The scan result will not be saved now. Are you sure you want to return Home?";
"Continue" = "Continue";
"Pause" = "Pause";
"Time remaining: %@" = "Time remaining: %@";
"Stop" = "Stop";
"Loading search content, please wait…" = "Loading search content, please wait…";
"Back" = "Back";
"Scanning...(%.1f%%)" = "Scanning… (%.1f%%)";
"Scanning..." = "Scanning…";
"%li files found (%.1f%%)" = "%li files found (%.1f%%)";
"%li items found, %@" = "%li items found, %@";
"Selected: %li files, %@" = "Selected: %li files, %@";
"Home" = "Home";
"Recover" = "Recover";
"Search" = "Search";
"Scan completed!" = "Scan completed!";
"Loading content, please wait..." = "Loading content, please wait...";
"Unlock" = "Unlock";
"Password hint: %@"= "Password hint: %@";
"Password:" = "Password:";
"Please enter a password to unlock the disk \"%@\"." = "Please enter a password to unlock the disk \"%@\".";
"Wrong password" = "Wrong password";
"Cancel1" = "Cancel";

/*******加载窗口模块*****/
"Reading data from the disk, please wait…" = "Reading data from the disk, please wait…";
/*******选择磁盘模块*****/
"Select a location to start data recovery" =
"Select a location to start data recovery";
"Hard Drives" = "Hard Drives";
"External Drives" = "External Drives";
"%@ free of %@" = "%@ free of %@";
"Other Location" = "Other Location";
"The Whole Computer" = "The Whole Computer";
"UltData" = "UltData";
"To recover data from iOS devices, please switch to UltData-iOS" = "To recover data from iOS devices, please switch to UltData-iOS";
"UltFone iOS Data Recovery" = "UltFone iOS Data Recovery";
"To recover data from iOS devices, please switch to UltFone iOS Data Recovery" = "To recover data from iOS devices, please switch to UltFone iOS Data Recovery";
"Scan" = "Scan";
"Untitled" = "Untitled";
/*******关闭SIP模块*****/
"The selected external drive is not available or uninstalled, please reinsert and try again." =
"The selected external drive is not available or uninstalled, please reinsert and try again.";
"The selected File System is currently not supported. Please select other disks for data recovery." =
"The selected File System is currently not supported. Please select other disks for data recovery.";
"To recover data from \"macOS High Sierra\" disk, please follow steps below to disable System Integrity Protection first." =
"To recover data from the \"macOS High Sierra\" and later systems, you need to disable System Integrity Protection by following the steps below in advance.";
"Step 1." = "Step 1.";
"Hold down Command + R on the keyboard immediately when you restart the Mac. Keep holding until the Mac finishes startup process, and you will see the utilities window." =
"Hold down Command + R on the keyboard immediately when you restart the Mac. Keep holding until the Mac finishes startup process, and you will see the utilities window.";
"Command + R" = "Command + R";
"Note: If you are using iMac/iMac Pro, please use wired keyboard." =
"Note: If you are using iMac/iMac Pro, please use wired keyboard.";
"Step 2." = "Step 2.";
"Open Terminal from the Utilities menu." =
"Open Terminal from the Utilities menu.";
"Terminal" = "Terminal";
"Utilities" = "Utilities";
"Step 3." = "Step 3.";
"Type the following command and hit Enter key to disable SIP. Then restart your Mac again." =
"Type the following command and hit Enter key to disable SIP. Then restart your Mac again.";
"Enter" = "Enter";
"Your Mac will restart during this process. Please take a photo with your phone and save steps." =
"Your Mac will restart during this process. Please take a photo with your phone and save steps.";
/*******扫描中模块*****/
"Name" = "Name";
"Created Date" = "Created Date";
"Modified Date" = "Modified Date";
"Path" = "Path";
"Type" = "Type";
"Size" = "Size";
"Files not found!" = "Files not found!";
"folder" = "folder";
"file" = "file";

// 2.7.0新增
"PREV" = "PREV";
"NEXT" = "NEXT";
"GO TO" = "GO TO:";
"Didn't find the missing data? Try using Deep Scan." = "Didn't find the missing data? Try using Deep Scan.";
"Deep Scan" = "Deep Scan";
"Previous Scan Results" = "Previous Scan Results";
"Returning to the last scan result requires stopping the current scan. Are you sure you want to stop?" = "Returning to the last scan result requires stopping the current scan. Are you sure you want to stop?";
"Stop" = "Stop";
"Cancel" = "Cancel";
"Deep scan completed!" = "Deep scan completed!";
"OK" = "OK";
"Loading content, please wait…" = "Loading content, please wait…";
"View Deep Scan Results" = "View Deep Scan Results";
"List View" = "List View";
"Thumbnail" = "Thumbnail";
"Preview Pane" = "Preview Pane";
"Preview" = "Preview";
"This format file does not support to preview." = "This format file does not support to preview.";
"This file may be corrupt and can't be previewed." = "This file may be corrupt and can't be previewed.";
"File size that exceeds 8 MB does not support to preview." = "File size that exceeds 8 MB does not support to preview.";
"The lost data may be damaged at any time and cannot be recovered. It is recommended to recover them earlier for higher recovery rate." = "The lost data may be damaged at any time and cannot be recovered. It is recommended to recover them earlier for higher recovery rate.";
"Buy now to save 70%" = "Buy now to save 70%";
"Unlimited Data Recovery" = "Unlimited Data Recovery";
"Recover your valuable data easily and quickly." = "Recover your valuable data easily and quickly.";
"Multiple File Types" = "Multiple File Types";
"Recover 550+ types of files from hard drive, memory card, etc." = "Recover 550+ types of files from hard drive, memory card, etc.";
"Professional Support" = "Professional Support";
"Provide professional and quality customer support." = "Provide professional and quality customer support.";
"Free Update" = "Free Update";
"Enjoy free update within license validity." = "Enjoy free update within license validity.";
"Already have a registration code? Register now" = "Already have a registration code? Register now";
"Register now" = "Register now";
"To recover data from crashed computer, please click here." = "To recover data from crashed computer, please click here.";
"click here" = "click here";

// pe制作
"Downloading boot system image, please wait…" = "Downloading boot system image, please wait…";
"When downloading the system image, please do not operate the disk or eject it." = "When downloading the system image, please do not operate the disk or eject it.";
"Are you sure you want to stop downloading the boot system image?" = "Are you sure you want to stop downloading the boot system image?";
"Creating a bootable drive using an SD card is not supported. Please use another storage device to create the bootable drive." = "Creating a bootable drive using an SD card is not supported. Please use another storage device to create the bootable drive.";


"Recover from Crashed System" = "Recover from Crashed System";
"Support to recover files from crashed system." = "Support to recover files from crashed system.";
"Recover Data from Crashed System" = "Recover Data from Crashed System";
"Recover lost files from crashed computer" = "Recover lost files from crashed computer";
"To recover data from iOS devices, please switch to iOS Data Recovery" = "To recover data from iOS devices, please switch to iOS Data Recovery";
"Creating bootable drive…" = "Creating bootable drive…";
"The bootable drive is created successfully!" = "The bootable drive is created successfully!";
"Please select a USB flash drive/external hard drive to create a bootable drive" = "Please select a USB flash drive/external hard drive to create a bootable drive.";
"Insert a USB flash drive/external hard drive to create a bootable drive, and then recover data from crashed system by the bootable drive." = "Insert a USB flash drive/external hard drive to create a bootable drive, and then recover data from crashed system by the bootable drive.";
"Bootable drive:" = "Bootable drive:";
"Refresh" = "Refresh";
"Note: Creating a bootable drive will format all data in the selected disk. Please back up your important data in advance." = "Note: Creating a bootable drive will format all data in the selected disk. Please back up your important data in advance.";
"Return" = "Return";
"Start" = "Start";
"OK" = "OK";
"Creating a bootable drive will format all data in the selected disk. Are you sure you want to continue?" = "Creating a bootable drive will format all data in the selected disk. Are you sure you want to continue?";
"Cancel" = "Cancel";
"The total disk space is less than 2GB. Please use a larger USB drive/external hard drive to create the bootable drive." = "The total disk space is less than 2GB. Please use a larger USB drive/external hard drive to create the bootable drive.";
"The local disk space is less than 2GB and the boot system image cannot be downloaded. Please free up some disk space before downloading." = "The local disk space is less than 2GB and the boot system image cannot be downloaded. Please free up some disk space before downloading.";
"Formatting the bootable drive, please wait…" = "Formatting the bootable drive, please wait…";
"When formatting the bootable drive, please do not operate or eject it." = "When formatting the bootable drive, please do not operate or eject it.";
"To avoid the burned disk be damaged, please be patient and wait for the burn to complete." = "To avoid the burned disk be damaged, please be patient and wait for the burn to complete.";
"Creating bootable drive, please wait…" = "Creating bootable drive, please wait…";
"When creating the bootable drive, please do not operate the disk or eject it." = "When creating the bootable drive, please do not operate the disk or eject it.";
"Follow the steps below to use the bootable drive to boot a Mac that cannot be turned on." = "Follow the steps below to use the bootable drive to boot a Mac that cannot be turned on.";
"bootable drive" = "bootable drive";
"cannot be turned on" = "cannot be turned on";
"black screen" = "black screen";
"Option key" = "Option key";
"%@ bootable drive" = "%@ bootable drive";
"Step 1: Insert the bootable drive into a Mac that cannot be turned on." = "Step 1: Insert the bootable drive into a Mac that cannot be turned on.";
"Step 2: Start the computer that cannot be turned on. When the Mac is in a black screen, press and hold the Option key. Release the Option key until you see the bootable drive." = "Step 2: Start the computer that cannot be turned on. When the Mac is in a black screen, press and hold the Option key. Release the Option key until you see the bootable drive.";
"Step 3: On the Select bootable drive interface, select the %@ bootable drive." = "Step 3: On the Select bootable drive interface, select the %@ bootable drive.";
"here" = "here";
"To see the detailed steps, please click here." = "To see the detailed steps, please click here.";
"Bootable drive creation failed!" = "Bootable drive creation failed!";
"Contact Us" = "Contact Us";
"Bootable drive creation failed! Please check if your disk is disconnected. You can click the Retry button or Contact Us." = "Bootable drive creation failed! Please check if your disk is disconnected. You can click the Retry button or Contact Us.";
"Retry" = "Retry";

"Select USB/external hard drive" = "Select USB/external hard drive";
"Completed!" = "Completed!";
"Format" = "Format";


// 3.0.1
"Please enter login password to allow disk access." = "Please enter login password to allow disk access.";

// 3.2.0
"note:" = "note:";
"1. If you have not received the registration code or don't know the register E-mail address, please click here to check." = "1. If you have not received the registration code or don't know the register E-mail address, please click here to check.";
"2. For other software or registration issues, please visit support center." = "2. For other software or registration issues, please visit support center.";
"click here to check" = "click here to check";
"visit support center" = "visit support center";

"To recover data from the \"macOS Catalina\" and later systems, Please follow the steps below to allow %@ to access removable volumes" =
"To recover data from the \"macOS Catalina\" and later systems, Please follow the steps below to allow %@ to access removable volumes";
"Step 1 :" = "Step 1 :";
"Step 2 :" = "Step 2 :";
"Step 3 :" = "Step 3 :";
"On your Mac, choose Apple menu  > System Preferences, click Security & Privacy." = "On your Mac, choose Apple menu  > System Preferences, click Security & Privacy.";
"Select the \"Removable Volumes\" checkbox below %@." = "Select the \"Removable Volumes\" checkbox below %@.";
"Click \"Later\" to allow %@ to access removable volumes." = "Click \"Later\" to allow %@ to access removable volumes.";
"Settings" = "Settings";
"OK" = "OK";

"To create a startup disk in \"macOS Catalina\" and later versions, Please follow the steps below to allow %@ to access removable volumes" =
"To create a startup disk in \"macOS Catalina\" and later versions, Please follow the steps below to allow %@ to access removable volumes";

"Sorry. Firmware downloading failed due to insufficient hard disk. Please release enough space (about %@) in your hard disk and then download again." = "Sorry. Firmware downloading failed due to insufficient hard disk. Please release enough space (about %@) in your hard disk and then download again. ";
"This file path cannot save the firmware. Please change to the correct one." = "This file path cannot save the firmware. Please change to the correct one.";
"Failed to download firmware package! Please check your Internet connection and try again." = "Failed to download firmware package! Please check your Internet connection and try again.";
"Downloading the firmware, please wait…" = "Downloading the firmware, please wait…";
"Please make sure the network connection is normal." = "Please make sure the network connection is normal.";
"Network Abnormal! Please check your network and try again." = "Network Abnormal! Please check your network and try again.";
"Try Again" = "Try Again";
"There is not enough space to download the firmware. Please free up at least 1 GB of free space and try again." = "There is not enough space to download the firmware. Please free up at least 1 GB of free space and try again.";
"Your Mac is equipped with Apple T2 Security Chip, files under the APFS file system cannot be scanned out." = "Your Mac is equipped with Apple T2 Security Chip, files under the APFS file system cannot be scanned out.";
"Failed to download firmware package! Please check your internet connection and try again." = "Failed to download firmware package! Please check your internet connection and try again.";
"Fast Scan done! Finding more lost data with Deep Scan..." = "Fast Scan done! Finding more lost data with Deep Scan...";
"Deep Scanning" = "Deep Scanning";
"Fast Scanning:" = "Fast Scanning";
"RAW Files" = "RAW Files";
"Tag Files" = "Tag Files";
"Deleted Files" = "Deleted Files";
"Lost Location" = "Lost Location";
"Existing Files" = "Existing Files";

//mark:4.0.0
"Found %li files. More useful tips below for finding files:" = "Found %li files. More useful tips below for finding files:";
"File Path Not Found" = "File Path Not Found";
"File Name Not Found" = "File Name Not Found";
"Tagged Files" = "Tagged Files";
"You may find your accidentally deleted files here." = "You may find your accidentally deleted files here.";
"There are deleted files that lost their original path. You can check file names to see if they are target files." = "There are deleted files that lost their original path. You can check file names to see if they are target files.";
"There are files that lost their original names. You can preview them to see if they are target files." = "There are files that lost their original names. You can preview them to see if they are target files.";
"You may find target files here if you lost them which are not deleted before." = "You may find target files here if you lost them which are not deleted before.";
"Lost files without name will be renamed and classified here with corresponding tags." = "Lost files without name will be renamed and classified here with corresponding tags.";
"Unable to preview. Please recover and save it on your computer for further checking." = "Unable to preview. Please recover and save it on your computer for further checking.";
"Trying to find more data... You can search and recover your data now." = "Trying to find more data... You can search and recover your data now.";
"Didn't find the missing files? Try Deep Scan." = "Didn't find the missing files? Try Deep Scan.";
"The Deep Scan can scour the device inch by inch to find the deeply buried files, enabling a higher recovery rate." = "The Deep Scan can scour the device inch by inch to find the deeply buried files, enabling a higher recovery rate.";
"Artist" = "Artist";
"Camera" = "Camera";
"The Last Editor" = "The Last Editor";
"Creation Time" = "Creation Time";
"Modified Time" = "Modified Time";
"All Time" = "All Time";
"Last 24 hours" = "Last 24 hours";
"Last 7 days" = "Last 7 days";
"Last 30 days" = "Last 30 days";
"Customize" = "Customize";
"Selected" = "Selected";
"File Size" = "File Size";
"All Size" = "All Size";
"Improve Chances of Finding Lost Files" = "Improve Chances of Finding Lost Files";
"Refer to the \"Tagged Files\" and \"File Name Not Found\" under the Tree View." = "Refer to the \"Tagged Files\" and \"File Name Not Found\" under the Tree View.";
"Filter files by File Type, File Size, Date Modified, and more." = "Filter files by File Type, File Size, Date Modified, and more.";
"Upgrade to Pro Version to Recover Your Valuable Data!" = "Upgrade to Pro Version to Recover Your Valuable Data!";
"Get the Pro Version to Create a Bootable Drive for Data Recovery!" = "Get the Pro Version to Create a Bootable Drive for Data Recovery!";
"Free Version" = "Free Version";
"Pro Version" = "Pro Version";
"Preview Just a Few Files" = "Preview Just a Few Files";
"Preview All Files" = "Preview All Files";
"Free Upgrade" = "Free Upgrade";
"Recover Data from the Crashed Computer" = "Recover Data from the Crashed Computer";
"Only Allows You to Scan Disks" = "Only Allows You to Scan Disks";
"Unlimited Data Recovery" = "Unlimited Data Recovery";
"Professional Customer Service" = "Professional Customer Service";
"Professional and reliable data recovery solutions" = "Professional and reliable data recovery solutions";
"Advanced Options" = "Advanced Options";
"Local Drives" = "Local Drives";
"External Drives" = "External Drives";
"Common Location" = "Common Location";
"Data Recovery" = "Data Recovery";
"Fast and Safe" = "Fast and Safe";
"Failed to read the disk data, please re-plug the external disk." = "Failed to read the disk data, please re-plug the external disk.";
"Please remove all external disks connected to the computer, and then reinsert the disk that needs data recovery." = "Please remove all external disks connected to the computer, and then reinsert the disk that needs data recovery.";
"Still have problems? Please contact us." = "Still have problems? Please contact us.";
"To recover data from digital camera, please remove the SD card and connect it to computer via card reader." = "To recover data from digital camera, please remove the SD card and connect it to computer via card reader.";
"Found nothing..." = "Found nothing...";
"1. Wait for the scan to finish before searching again." = "1. Wait for the scan to finish before searching again.";
"2. Your file is most likely missing the filename. Try searching in this way." = "2. Your file is most likely missing the filename. Try searching in this way.";
"3. Make sure the term you're looking for is spelled correctly." = "3. Make sure the term you're looking for is spelled correctly.";
"4. If none of the above methods help, please contact us." = "4. If none of the above methods help, please contact us.";
"Reading data from the disk，please wait…" = "Reading data from the disk，please wait…";
"Stuck in refreshing status for a long time?" = "Stuck in refreshing status for a long time?";
"Effortlessly Recover Data from A Crashed Computer" = "Effortlessly Recover Data from A Crashed Computer";
"View Files" = "View Files";
"It might take a long time to export for some files need repairing..." = "It might take a long time to export for some files need repairing...";
"contact us" = "contact us";
"in this way" = "in this way";
"Exit App" = "Exit App";
"Recovered: %li file %@" = "Recovered: %li file (%@)";
"Recovered: %li files %@" = "Recovered: %li files (%@)";
"File Types" = "File Types";
"File Tags" = "File Tags";
"Move your mouse to the icon under Tree View, and you'll learn the explanation of each file category." = "Move your mouse to the icon under Tree View, and you'll learn the explanation of each file category.";
"Understood" = "Understood";
"Filter" = "Filter";
"Reset" = "Reset";
"Scan Stopped!" = "Scan Stopped!";
"Tips:" = "Tips:";
"1. Please replug the external drive or change another drive and then try again." = "1. Please replug the external drive or change another drive and then try again.";
"2. Please make sure internet connection is working properly." = "2. Please make sure internet connection is working properly.";

// V5.0.0
"Get An Extra" = "Get An Extra";
"Coupon Code:" = "Coupon Code:";
"Copy and paste the coupon code at checkout to redeem." = "Copy and paste the coupon code at checkout to redeem.";
"Copy and Buy Now" = "Copy and Buy Now";
"Close Program" = "Close Program";
"Photo Repair" = "Photo Repair";
"Video Repair" = "Video Repair";
"Repair Damaged Videos in Just Three Steps!" = "Repair Damaged Videos in Just Three Steps!";
"Repair Damaged Photos in Just Three Steps!" = "Repair Damaged Photos in Just Three Steps!";
"Import Video" = "Import Video";
"Import Photo" = "Import Photo";
"Start Repairing" = "Start Repairing";
"Repair Done!" = "Repair Done!";
"Click to Add Photos" = "Click to Add Photos";
"Click to Add Videos" = "Click to Add Videos";
"%liPhoto Added，%@KB" = "%li Photo Added，%@";
"%liVideo Added，%@KB" = "%li Video Added，%@";
"%liPhotos Added，%@KB" = "%li Photos Added，%@";
"%liVideos Added，%@KB" = "%li Videos Added，%@";
"Add Photo" = "Add Photo";
"Add Video" = "Add Video";
"Home" = "Home";
"Repair" = "Repair";
"Remove All Image" = "Remove All";
"Remove All Video" = "Remove All";
"This photo can't be repaired." = "This photo can't be repaired.";
"This video can't be repaired." = "This video can't be repaired.";
"Select All" = "Select All";
"Select all successfully repaired photos" = "Select all successfully repaired photos";
"Reselect photo to repair" = "Reselect photo to repair";
"Select All" = "Select All";
"Select all successfully repaired videos" = "Select all successfully repaired videos";
"Reselect video to repair" = "Reselect video to repair";
"We've found several photos from this photo that you might be looking for, and you can preview and export them." = "We've found several photos from this photo that you might be looking for, and you can preview and export them.";
"We've found several videos from this video that you might be looking for, and you can preview and export them." = "We've found several videos from this video that you might be looking for, and you can preview and export them.";
"Are you sure you want to remove all photos?" = "Are you sure you want to remove all photos?";
"Are you sure you want to remove all videos?" = "Are you sure you want to remove all videos?";
"Are you sure you want to return to the home page? The current repair progress will not be saved." = "Are you sure you want to return to the home page? The current repair progress will not be saved.";
"Are you sure you want to return to the home page? The current repair progress will not be saved." = "Are you sure you want to return to the home page? The current repair progress will not be saved.";
"Are you sure you want to reselect the video? The current repair progress will not be saved." = "Are you sure you want to reselect the video? The current repair progress will not be saved.";
"Are you sure you want to reselect the photo? The current repair progress will not be saved." = "Are you sure you want to reselect the photo? The current repair progress will not be saved.";
"Some videos are already in the repair list and will not be imported repeatedly." = "Some videos are already in the repair list and will not be imported repeatedly.";
"Some photos are already in the repair list and will not be imported repeatedly." = "Some photos are already in the repair list and will not be imported repeatedly.";
"The video has been lost, please re-import and try previewing again." = "The video has been lost, please re-import and try previewing again.";
"The photo has been lost, please re-import and try previewing again." = "The photo has been lost, please re-import and try previewing again.";
"Scanning or recovery cannot continue because the device is disconnected, please re-plug the device and click Continue." = "Scanning or recovery cannot continue because the device is disconnected, please re-plug the device and click Continue.";
"Repairing：" = "Repairing：";
"Please wait..." = "Please wait...";
"Exporting:" = "Exporting:";
"The device has been disconnected, you can try to select data to recover or rescan." = "The device has been disconnected, you can try to select data to recover or rescan.";
"Continue" = "Continue";
"Retry" = "Retry";
"Stop" = "Stop";
"Export Completed!" = "Export Completed!";
"Export: %lifiles(%@)" = "Export: %li files (%@)";
"View Exported" = "View Exported";
"There are still %li videos to export, are you sure you want to stop exporting?" = "There are still %li videos to export, are you sure you want to stop exporting?";
"There are still %li photos to export, are you sure you want to stop exporting?" = "There are still %li photos to export, are you sure you want to stop exporting?";
"There are still 1 video to export, are you sure you want to stop exporting?" = "There are still 1 video to export, are you sure you want to stop exporting?";
"There are still 1 photo to export, are you sure you want to stop exporting?" = "There are still 1 photo to export, are you sure you want to stop exporting?";
"Are you sure you want to stop exporting?" = "Are you sure you want to stop exporting?";
"Upgrade to Pro version to preview files!" = "Upgrade to Pro version to preview files!";
"Upgrade" = "Upgrade";
"The unregistered version can only play the first 30s of the audio file, upgrade to the registered version for full playback." = "The unregistered version can only play the first 30s of the video file, upgrade to the registered version for full playback.";
"The unregistered version can only play the first 10s of the video file, upgrade to the registered version for full playback." = "The unregistered version can only play the first 10s of the video file, upgrade to the registered version for full playback.";
"Upgrade to Pro Version to Export your Valuable Photos!" = "Upgrade to Pro Version to Export your Valuable Photos!";
"Upgrade to Pro Version to Export your Valuable Videos!" = "Upgrade to Pro Version to Export your Valuable Videos!";
"Support for exporting repaired files" = "Support for exporting repaired files";

//MARK: - 第二版
"The file can't be previewed, please export it and try to preview it again." = "The file can't be previewed, please export it and try to preview it again.";
"The file can't be previewed, please repair it and try to preview it again." = "The file can't be previewed, please repair it and try to preview it again.";
"Are you sure you want to exit the program? Current repair progress will not be retained." = "Are you sure you want to exit the program? Current repair progress will not be retained.";
"There are still %li videos waiting to be repaired, are you sure you want to stop the repair?" = "There are still %li videos waiting to be repaired, are you sure you want to stop the repair?";
"There are still %li photos waiting to be repaired, are you sure you want to stop the repair?" = "There are still %li photos waiting to be repaired, are you sure you want to stop the repair?";
"There is still 1 video waiting to be repaired, are you sure you want to stop the repair?" = "There is still 1 video waiting to be repaired, are you sure you want to stop the repair?";
"There is still 1 photo waiting to be repaired, are you sure you want to stop the repair?" = "There is still 1 photo waiting to be repaired, are you sure you want to stop the repair?";
"Are you sure you want to stop repairing?" = "Are you sure you want to stop repairing?";
"Repair done!" = "Repair done!";
"Repaired: %li files (%@)" = "Repaired: %li files (%@)";
"View Repair Results" = "View Repair Results";
"Export" = "Export";
"The video has been lost, please re-repair and try exporting again." = "The video has been lost, please re-repair and try exporting again.";
"The photo has been lost, please re-repair and try exporting again." = "The photo has been lost, please re-repair and try exporting again.";
"The video has been lost, please re-import and try repairing again." = "The video has been lost, please re-import and try repairing again.";
"The photo has been lost, please re-import and try repairing again." = "The photo has been lost, please re-import and try repairing again.";
"Selected: %li photo  (%@)" = "Selected: %li photo  (%@)";
"Selected: %li photos  (%@)" = "Selected: %li photos  (%@)";
"Selected: %li video  (%@)" = "Selected: %li video  (%@)";
"Selected: %li videos  (%@)" = "Selected: %li videos  (%@)";
"%li Results" = "%li Results";
"Close" = "Close";

// 5.1.0
"Match Similar Files" = "Match Similar Files";
"We've found some files that might be what you want, you can preview and restore them." = "We've found some files that might be what you want, you can preview and restore them.";
"Sorry, no matching files were found at this time. You can wait for the scan to finish and try again, or use Filter, Search Bar to find the files you want." = "Sorry, no matching files were found at this time. You can wait for the scan to finish and try again, or use Filter, Search Bar to find the files you want.";
"What Type of Files Do You Want to Recover?" = "What Type of Files Do You Want to Recover?";
"Filtering file type helps recover the files you want faster" = "Filtering file type helps recover the files you want faster";
"Others" = "Others";
"Other Types" = "Other Types";
"%@ etc." = "%@ etc.";
"Scan Selected File Types" = "Scan Selected File Types";
"Scan All File Types" = "Scan All File Types";
"Scan Only %@" = "Scan Only %@";


//MARK: - 预览
"Preview" = "Preview";
"Loading..." = "Loading...";
"Preview is not available. Recover it for view" = "Preview is not available. Recover it for view";
"Max size for preview: 30MB. Recover it for view" = "Max size for preview: 30MB. Recover it for view";
"Format not supported for preview. Recover it for view" = "Format not supported for preview. Recover it for view";
"%@ files zipped in total" = "%@ files zipped in total";
"AI Repairing..." = "AI Repairing...";
"It may take a while, but it's worth the wait" = "It may take a while, but it's worth the wait";
"AI Repaired %@" = "AI Repaired %@";
"Repaired successfully. Recover the repaired file" = "Repaired successfully. Recover the repaired file";
"Get Pro for Full Preview" = "Get Pro for Full Preview";
"Preview full file" = "Preview full file";
"Recover unlimited files" = "Recover unlimited files";
"AI Repair corrupte files" = "AI Repair corrupte files";
"Premium technical support" = "Premium technical support";
"Get Pro Now" = "Get Pro Now";
"Details" = "Details";
"Icon" = "Icon";


//MARK: - 付费升级弹窗
"Get Pro for Unlimited Recovery" = "Get Pro for Unlimited Recovery";
"Preview only." = "Preview only.";
"No free recovery remaining." = "No free recovery remaining.";
"Unlock Pro to enjoy full features, unlimited recovery and more benefits." = "Unlock Pro to enjoy full features, unlimited recovery and more benefits.";
"Get Pro for Unlimited Repair" = "Get Pro for Unlimited Repair";
"Unlock Pro to enjoy full features, unlimited repair and more benefits." = "Unlock Pro to enjoy full features, unlimited repair and more benefits.";
"Trial" = "Trial";
"Free" = "Free";
"Pro" = "Pro";
"Preview only" = "Preview only";
"Unlimited" = "Unlimited";
"Key Features & Benefits" = "Key Features & Benefits";
"Recovery amount" = "Recovery amount";
"Preview before recovery" = "Preview before recovery";
"Recover while scanning" = "Recover while scanning";
"Recover data from crashed system" = "Recover data from crashed system";
"Recover data from NAS server" = "Recover data from NAS server";
"Repair corrupted vidoes & photos" = "Repair corrupted vidoes & photos";
"Enjoy lifetime updates for free" = "Enjoy lifetime updates for free";
"24/7 premium technical support" = "24/7 premium technical support";
"30-day money back guarantee" = "30-day money back guarantee";
"Buy Now" = "Buy Now";
"Already Purchased?" = "Already Purchased?";
"Register Now to proceed with recovering ( no need to rescan)." = "Register Now to proceed with recovering ( no need to rescan).";
"Register Now" = "Register Now";
"Recover the repaired file" = "Recover the repaired file";
"Recover it for view" = "Recover it for view";

//MARK: - 5.1.8
"Lost data recovery" = "Lost data recovery";
"Hard Drive" = "Hard Drive";
"Advanced recovery" = "Advanced recovery";
"Crashed Mac" = "Crashed Mac";
"iCloud" = "iCloud";
"New" = "New";
"Corrupted file repair" = "Corrupted file repair";
"Photo Repair" = "Photo Repair";
"Video Repair" = "Video Repair";
"Why Pro？" = "Why Pro？";
"Unlock Pro to enjoy" = "Unlock Pro to enjoy";
"Unlimited Recovery" = "Unlimited Recovery";
"Corrupted Repair" = "Corrupted Repair";
"Full Preview" = "Full Preview";
"Unlock Pro Now" = "Unlock Pro Now";
"Recover permanently & recently deleted iCloud data easily" = "Recover permanently & recently deleted iCloud data easily";
"Recover any lost photos, videos, contacts, notes and more from iCloud directly" = "Recover any lost photos, videos, contacts, notes and more from iCloud directly";
"Get Started" = "Get Started";
"Searching lost iCloud data..." = "Searching lost iCloud data...";
"Search Completed" = "Search Completed";
"Search Stopped" = "Search Stopped";
"Damaged or partitially missing photos" = "Damaged or partitially missing photos";
"Add photos for repair" = "Add photos for repair";
"Corrupted or unplayable vidoes" = "Corrupted or unplayable vidoes";
"Add videos for repair" = "Add videos for repair";

"Repair any damaged or photos that cannot be opened" = "Repair any damaged or photos that cannot be opened";
"Repair any corrupted or unplayale videos files and more" = "Repair any corrupted or unplayale videos files and more";
//MARK: - v5.1.10
"Sign in to iCloud" = "Sign in to iCloud";
"Apple ID" = "Apple ID";
"Password" = "Password";
"Keep Password" = "Keep Password";
"Forget Apple ID or Password?" = "Forget Apple ID or Password?";
"Back" = "Back";
"Log In" = "Log In";
"1. To prevent changes to iCloud, do not sync device data to iCloud while recovering." = "1. To prevent changes to iCloud, do not sync device data to iCloud while recovering.";
"2. We NEVER keep records of your account. For more details, please refer to our Privacy Policy." = "2. We NEVER keep records of your account. For more details, please refer to our Privacy Policy.";
"Privacy Policy" = "Privacy Policy";
"Incorrect Apple ID or password." = "Incorrect Apple ID or password.";
"For security reasons, your Apple ID is locked. Please unlock your account and try again." = "For security reasons, your Apple ID is locked. Please unlock your account and try again.";
"Network disconnected. Please check your network connection and try again." = "Network disconnected. Please check your network connection and try again.";
"Two-factor authentication" = "Two-factor authentication";
"A verification code message has been sent to your trusted device. Please enter the code to continue." = "A verification code message has been sent to your trusted device. Please enter the code to continue.";
"Resend code" = "Resend code";
"Get Help from Apple" = "Get Help from Apple";
"Incorrect verification code." = "Incorrect verification code.";
"Entered incorrect verification code too many times." = "Entered incorrect verification code too many times.";
"Request failed, please try again." = "Request failed, please try again.";
"Verification requested too often" = "Verification requested too often";
"Network error. Please check your network connection." = "Network error. Please check your network connection.";
"Please select the type of data you want to recover." = "Please select the type of data you want to recover.";
"Log Out" = "Log Out";
"Select all" = "Select all";
"Refresh" = "Refresh";
"Back" = "Back";
"Confirm" = "Confirm";
"iCloud drive" = "iCloud drive";
"Photos" = "Photos";
"Contacts" = "Contacts";
"Reminder" = "Reminder";
"Calendar" = "Calendar";
"Notes" = "Notes";

"Home Phone" = "Home Number";
"Work" = "Work Number";
"iPhone" = "iPhone Number";
"Mobile Phone" = "Cell Phone Number";
"Main Phone" = "Main Number";
"HomeFax" = "Residential Fax No";
"WorkFax" = "Work Fax";
"Pager Phone" = "Beep Pager";
"Other Phone" = "Other Numbers";

"Home Email" = "Family Email";
"Work Email" = "Work Email";
"Other Email" = "Other Email";
"iCloud Email" = "iCloud Email";

"HomePage" = "Homepage";
"Home Page" = "Family Page";
"Other Page" = "Other Page";
"Work Page" = "Work Page";

"Title" = "Title";
"Starting Time" = "Starting Time";
"List" = "List";
"Status" = "Status";
"Reminder time" = "Reminder time";
"Priority" = "Priority";
"Location" = "Location";

//MARK: - 第二批_3.21
"Company" = "Company";
"School" = "School";
"Time" = "Time";
"End Date Time" = "End Date Time";
"Complete" = "Complete";
"Incomplete" = "Incomplete";
"Invited People" = "Invited People";
"Flag Marks" = "Flag Marks";
"None" = "None";
"Low" = "Low";
"Medium" = "Medium";
"High" = "High";
"Unknown" = "Unknown";
//MARK: - 5.1.11
"Unsaved Documents" = "Unsaved Documents";
"Date Deleted" = "Date Deleted";

//MARK: - PE
"Crashed Mac" = "Crashed Mac";
"Create a bootable drive to boot up Mac for data recovery" = "Create a bootable drive to boot up Mac for data recovery";
"What's Crashed Mac？" = "What's Crashed Mac？";
"Boot up Mac with the USB bootable drive for data recovery" = "Boot up Mac with the USB bootable drive for data recovery";
"Boot up crashed Mac" = "Boot up crashed Mac";
"Tips: please try again with another USB drive Common Solutions" = "Tips: please try again with another USB drive Common Solutions";
"Common Solutions" = "Common Solutions";
"Icon" = "Icon";
"Preview Pane" = "Preview Pane";
"Details" = "Details";
"Create Now" = "Create Now";

"Lost Partition" = "Lost Partition";

"Select a drive where you lost data to start recovering" = "Select a drive where you lost data to start recovering";
"Drive didn't show up?" = "Drive didn't show up?";
"Check Disk Connection" = "Check Disk Connection";
"To recover data from digital camera, please remove the SD card and connect it to Mac via card reader." = "To recover data from digital camera, please remove the SD card and connect it to Mac via card reader.";
"When the USB device cannot be recognized, please try to connnect it to the back USB ports for data recovery." = "When the USB device cannot be recognized, please try to connnect it to the back USB ports for data recovery.";
"For data recovery from mobile phones, you can download UltData - iOS." = "For data recovery from mobile phones, you can download UltData - iOS.";
"Check Disk Status" = "Check Disk Status";
"Solution: Access Disk Utility, click the \"Mount\" button on the top menu bar, and then recover your data." = "Solution: Access Disk Utility, click the \"Mount\" button on the top menu bar, and then recover your data.";
"Language_menu" = "Language";
"Disk Utility" = "Disk Utility";
"Mount" = "Mount";
"1. Access \"Disk Utility\"" = "1. Access \"Disk Utility\"";
"2. Click \"Mount\"" = "2. Click \"Mount\"";

//MARK: - V5.1.18
"Select a location to save the recovered data" = "Select a location to save the recovered data";
"You've selected %li files, %@" = "You've selected %li files, %@";
"%@ available" = "%@ available";
"Perfectly enough disk space. Save now." = "Perfectly enough disk space. Save now.";
"Save to the %@ and you don’t have to worry about data loss anymore." = "Save to the %@ and you don’t have to worry about data loss anymore.";
"Save Now" = "Save Now";
"Insufficient space available, change another location or save to the %@." = "Insufficient space available, change another location or save to the %@.";
"It is not recommended to save to the original disk (where the data is lost), as it may have the data to be overwritten and lost permanently." = "It is not recommended to save to the original disk (where the data is lost), as it may have the data to be overwritten and lost permanently.";
"No permissions to read or write, change another location or save to the %@." = "No permissions to read or write, change another location or save to the %@.";
"Insufficient space available in %@. Please change to another location to save." = "Insufficient space available in %@. Please change to another location to save.";
"Select Folder..." = "Select Folder...";
"Logging in..." = "Logging in...";
"Please authorize login to your %@ in the browser" = "Please authorize login to your %@ in the browser";
"Authorization login failed" = "Authorization login failed";
"Please re-authorize or change to another location" = "Please re-authorize or change to another location";
"Another Location" = "Another Location";
"Re-authorize" = "Re-authorize";
"Authorization successful. Please return to %@ to continue recovering data." = "Authorization successful. Please return to %@ to continue recovering data.";

//MARK: - V5.2.0
"Large & Old Files" = "Large & Old Files";
"Locate and remove unneeded files to free up disk space with ease" = "Locate and remove unneeded files to free up disk space with ease";
"Locate Files in Minutes" = "Locate Files in Minutes";
"Finding large or old files manually could take you hours, but with %@ you’ll be done within minutes." = "Finding large or old files manually could take you hours, but with %@ you’ll be done within minutes.";
"Remove As You Wish" = "Remove As You Wish";
"Remove unneeded files to trash, another folder or permanently. It's always your call." = "Remove unneeded files to trash, another folder or permanently. It's always your call.";
"%@ used" = "%@ used";
"Scan Now" = "Scan Now";
"All Files" = "All Files";
"Selected" = "Selected";
"By Size" = "By Size";
"By Access Date" = "By Access Date";
"Last Week" = "Last Week";
"Last Month" = "Last Month";
"Scanning %@" = "Scanning %@";
"Looking for large & old files" = "Looking for large & old files";
"Stop Scanning" = "Stop Scanning";
"No files found" = "No files found";
"Return to home and select another location to start over" = "Return to home and select another location to start over";
"Removing: %@" = "Removing: %@";
"It may take some time..." = "It may take some time...";
"Remove Completed" = "Remove Completed";
"Removed: %li files (%@)" = "Removed: %li files (%@)";
"Done" = "Done";
"Insufficient permissions to remove" = "Insufficient permissions to remove";
"No read/write permissions for NTFS partition, and it cannot be removed." = "No read/write permissions for NTFS partition, and it cannot be removed.";
"Insufficient space at target folder to remove" = "Insufficient space at target folder to remove";
"Remove to another folder or remove permanently." = "Remove to another folder or remove permanently.";
"No files selected" = "No files selected";
"Remove Permanently" = "Remove Permanently";
"Remove to Trash" = "Remove to Trash";
"Remove to Folder" = "Remove to Folder";
"Access Time" = "Access Time";
"Open File Location" = "Open File Location";
"Return to home?" = "Return to home?";
"It is recommended to remove unwanted files before you return." = "It is recommended to remove unwanted files before you return.";
"Return" = "Return";
"Cancel" = "Cancel";
"Stop Scanning?" = "Stop Scanning?";
"%@ will be no longer looking for large & old files if you stop." = "%@ will be no longer looking for large & old files if you stop.";
"Stop Scanning" = "Stop Scanning";
"Stop Removing?" = "Stop Removing?";
"%@ will be no longer removing files remaining if you stop." = "%@ will be no longer removing files remaining if you stop.";
"Stop Removing" = "Stop Removing";
"Get Pro for Files Removal" = "Get Pro for Files Removal";
"Unlock Pro to remove unwanted large & old files, and enjoy more features, including unlimited data recovery." = "Unlock Pro to remove unwanted large & old files, and enjoy more features, including unlimited data recovery.";
"Files available for removal" = "Files available for removal";
"Authorizing for %@, please wait..." = "Authorizing for %@, please wait...";
"Calculating the available space in %@, please wait..." = "Calculating the available space in %@, please wait...";

//MARK: - 第二批_20240626
"Extra tools" = "Extra tools";
"Sort by %@" = "Sort by %@";
"By Modified Date" = "By Modified Date";

//MARK: - 2. SD卡
"SD Card" = "SD Card";
"Select a memory card where you lost data to start recovering" = "Select a memory card where you lost data to start recovering";
"SD card didn't show up?" = "SD card didn't show up?";
"No SD card connected" = "No SD card connected";
"Connect the memory card via card reader to start recovering photos or videos" = "Connect the memory card via card reader to start recovering photos or videos";
//MARK: - 视频重组
"Enhanced Video Recovery" = "Enhanced Video Recovery";
"Scan and match video fragments in any storage media through AI advanced algorithms to recover a complete and playable video" = "Scan and match video fragments in any storage media through AI advanced algorithms to recover a complete and playable video";
"Repair & recover vidoes at the same time, providing one-stop video solution" = "Repair & recover vidoes at the same time, providing one-stop video solution";
"Easily recover & repair videos from any devices, such as Canon, Nikon, Sony, GoPro, and DJI, etc. Learn more" = "Easily recover & repair videos from any devices, such as Canon, Nikon, Sony, GoPro, and DJI, etc. Learn more";
"AI-Powered" = "AI-Powered";
"Mac OS 10.15 previous versions are not supported" = "Mac OS 10.15 previous versions are not supported";
"Try 'Enhanced Video Recovery' with Mac OS 10.15 or later" = "Try 'Enhanced Video Recovery' with Mac OS 10.15 or later";
"Select a drive where you lost vidoes to start recovering" = "Select a drive where you lost vidoes to start recovering";
"Tips: Don't know which drive to scan, as you're not sure where the vidoe was lost?" = "Tips: Don't know which drive to scan, as you're not sure where the vidoe was lost?";
"Select the video format you want to recover" = "Select the video format you want to recover";
"All videos" = "All videos";
"Recovery duration: The more video types selected, the longer it will take." = "Recovery duration: The more video types selected, the longer it will take.";
"Device that the vidoes are from (optional)" = "Device that the vidoes are from (optional)";
"Note: correct source device contributes to the targeted and precise recovery, significantly improving the recovery quality." = "Note: correct source device contributes to the targeted and precise recovery, significantly improving the recovery quality.";
"Confirm" = "Confirm";
"Canon" = "Canon";
"GoPro" = "GoPro";
"Nikon" = "Nikon";
"Sony" = "Sony";
"Fujifilm" = "Fujifilm";
"DJI" = "DJI";
"Apeman" = "Apeman";
"Papago" = "Papago";
"Vantrue" = "Vantrue";
"Rexing" = "Rexing";
"Others" = "Others";
"Please select at least one video format for enhanced video recovery" = "Please select at least one video format for enhanced video recovery";
"Select All" = "Select All";
"AI" = "AI";
"Video enhanced recovering...some black screen and unplayable vidoes could be repaired by AI once it completes." = "Video enhanced recovering...some black screen and unplayable vidoes could be repaired by AI once it completes.";
"Learn more" = "Learn more";
